package org.example.Homework.homework2;

public class Task07 {
    /* Розробіть програму, яка дозволить обчислити суму вкладу банку
    через два роки за встановленим річним відсотком, якщо задана
    початкова величина вкладу.*/
    public static void main(String[] args) {
        double deposit = 5000; // величина вкладу
        double percent = 11; // річний відсоток
        double term = 2; // строк вкладу

        // по формулі складних відсотків (коли відсотки прибутку в кінці
        // кожного періоду додаються до основної суми і отримана величина в
        // подальшому стає базою для начислення нових відсотків)



        double amount = Math.ceil((deposit * Math.pow((1 + percent/100), term) * 100.0 )/ 100.0);

        System.out.println("Cума вкладу банку через два роки " + amount + " грн");
    }
}
